podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/GPIO_PORT_LPC13Uxx.svd.xml
<!--
Devices using this peripheral: 
      LPC13Uxx
-->
      <peripheral>
         <?sourceFile "GPIO_PORT_LPC13Uxx" ?>
         <name>GPIO_PORT</name>
         <description>GPIO port</description>
         <groupName>GPIO_PORT</groupName>
         <headerStructName>GPIO_PORT</headerStructName>
         <baseAddress>0x50000000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x40</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x1000</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x2000</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x2080</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x2100</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x2180</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x2200</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x2280</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x2300</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>B[0]</name>
               <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>PBYTE</name>
                     <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin&apos;s output bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register derivedFrom="B[0]"> <name>B[1]</name> <addressOffset>0x1</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[2]</name> <addressOffset>0x2</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[3]</name> <addressOffset>0x3</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[4]</name> <addressOffset>0x4</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[5]</name> <addressOffset>0x5</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[6]</name> <addressOffset>0x6</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[7]</name> <addressOffset>0x7</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[8]</name> <addressOffset>0x8</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[9]</name> <addressOffset>0x9</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[10]</name> <addressOffset>0xA</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[11]</name> <addressOffset>0xB</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[12]</name> <addressOffset>0xC</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[13]</name> <addressOffset>0xD</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[14]</name> <addressOffset>0xE</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[15]</name> <addressOffset>0xF</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[16]</name> <addressOffset>0x10</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[17]</name> <addressOffset>0x11</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[18]</name> <addressOffset>0x12</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[19]</name> <addressOffset>0x13</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[20]</name> <addressOffset>0x14</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[21]</name> <addressOffset>0x15</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[22]</name> <addressOffset>0x16</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[23]</name> <addressOffset>0x17</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[24]</name> <addressOffset>0x18</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[25]</name> <addressOffset>0x19</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[26]</name> <addressOffset>0x1A</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[27]</name> <addressOffset>0x1B</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[28]</name> <addressOffset>0x1C</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[29]</name> <addressOffset>0x1D</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[30]</name> <addressOffset>0x1E</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[31]</name> <addressOffset>0x1F</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[32]</name> <addressOffset>0x20</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[33]</name> <addressOffset>0x21</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[34]</name> <addressOffset>0x22</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[35]</name> <addressOffset>0x23</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[36]</name> <addressOffset>0x24</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[37]</name> <addressOffset>0x25</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[38]</name> <addressOffset>0x26</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[39]</name> <addressOffset>0x27</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[40]</name> <addressOffset>0x28</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[41]</name> <addressOffset>0x29</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[42]</name> <addressOffset>0x2A</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[43]</name> <addressOffset>0x2B</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[44]</name> <addressOffset>0x2C</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[45]</name> <addressOffset>0x2D</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[46]</name> <addressOffset>0x2E</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[47]</name> <addressOffset>0x2F</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[48]</name> <addressOffset>0x30</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[49]</name> <addressOffset>0x31</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[50]</name> <addressOffset>0x32</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[51]</name> <addressOffset>0x33</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[52]</name> <addressOffset>0x34</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[53]</name> <addressOffset>0x35</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[54]</name> <addressOffset>0x36</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[55]</name> <addressOffset>0x37</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[56]</name> <addressOffset>0x38</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[57]</name> <addressOffset>0x39</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[58]</name> <addressOffset>0x3A</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[59]</name> <addressOffset>0x3B</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[60]</name> <addressOffset>0x3C</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[61]</name> <addressOffset>0x3D</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[62]</name> <addressOffset>0x3E</addressOffset> </register>
            <register derivedFrom="B[0]"> <name>B[63]</name> <addressOffset>0x3F</addressOffset> </register>
            <register>
               <name>W[0]</name>
               <description>Word pin registers port 0/1</description>
               <addressOffset>0x1000</addressOffset>
               <fields>
                  <field>
                     <name>PWORD</name>
                     <description>Read 0: pin is LOW.  Write 0: clear output bit. Read 0xFFFF FFFF: pin is HIGH.  Write any value 0x0000 0001 to 0xFFFF FFFF: set output bit. Only 0 or 0xFFFF FFFF can be read. Writing any value other than 0 will set the output bit</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
