podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/GPIO_PORT_LPC13Uxx.svd.xml
            <register derivedFrom="W[0]"> <name>W[1]</name> <addressOffset>0x1004</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[2]</name> <addressOffset>0x1008</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[3]</name> <addressOffset>0x100C</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[4]</name> <addressOffset>0x1010</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[5]</name> <addressOffset>0x1014</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[6]</name> <addressOffset>0x1018</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[7]</name> <addressOffset>0x101C</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[8]</name> <addressOffset>0x1020</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[9]</name> <addressOffset>0x1024</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[10]</name> <addressOffset>0x1028</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[11]</name> <addressOffset>0x102C</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[12]</name> <addressOffset>0x1030</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[13]</name> <addressOffset>0x1034</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[14]</name> <addressOffset>0x1038</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[15]</name> <addressOffset>0x103C</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[16]</name> <addressOffset>0x1040</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[17]</name> <addressOffset>0x1044</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[18]</name> <addressOffset>0x1048</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[19]</name> <addressOffset>0x104C</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[20]</name> <addressOffset>0x1050</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[21]</name> <addressOffset>0x1054</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[22]</name> <addressOffset>0x1058</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[23]</name> <addressOffset>0x105C</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[24]</name> <addressOffset>0x1060</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[25]</name> <addressOffset>0x1064</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[26]</name> <addressOffset>0x1068</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[27]</name> <addressOffset>0x106C</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[28]</name> <addressOffset>0x1070</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[29]</name> <addressOffset>0x1074</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[30]</name> <addressOffset>0x1078</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[31]</name> <addressOffset>0x107C</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[32]</name> <addressOffset>0x1080</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[33]</name> <addressOffset>0x1084</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[34]</name> <addressOffset>0x1088</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[35]</name> <addressOffset>0x108C</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[36]</name> <addressOffset>0x1090</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[37]</name> <addressOffset>0x1094</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[38]</name> <addressOffset>0x1098</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[39]</name> <addressOffset>0x109C</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[40]</name> <addressOffset>0x10A0</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[41]</name> <addressOffset>0x10A4</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[42]</name> <addressOffset>0x10A8</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[43]</name> <addressOffset>0x10AC</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[44]</name> <addressOffset>0x10B0</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[45]</name> <addressOffset>0x10B4</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[46]</name> <addressOffset>0x10B8</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[47]</name> <addressOffset>0x10BC</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[48]</name> <addressOffset>0x10C0</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[49]</name> <addressOffset>0x10C4</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[50]</name> <addressOffset>0x10C8</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[51]</name> <addressOffset>0x10CC</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[52]</name> <addressOffset>0x10D0</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[53]</name> <addressOffset>0x10D4</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[54]</name> <addressOffset>0x10D8</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[55]</name> <addressOffset>0x10DC</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[56]</name> <addressOffset>0x10E0</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[57]</name> <addressOffset>0x10E4</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[58]</name> <addressOffset>0x10E8</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[59]</name> <addressOffset>0x10EC</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[60]</name> <addressOffset>0x10F0</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[61]</name> <addressOffset>0x10F4</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[62]</name> <addressOffset>0x10F8</addressOffset> </register>
            <register derivedFrom="W[0]"> <name>W[63]</name> <addressOffset>0x10FC</addressOffset> </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>DIR%s</name>
               <description>Direction registers port %s/1</description>
               <addressOffset>0x2000</addressOffset>
               <fields>
                  <field>
                     <name>DIRP0</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP1</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP2</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP3</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP4</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP5</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP6</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP7</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP8</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP9</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP10</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP11</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP12</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP13</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP14</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP15</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP16</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP17</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP18</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP19</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP20</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP21</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP22</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP23</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP24</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP25</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP26</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP27</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP28</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP29</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP30</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIRP31</name>
                     <description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
