podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/GPIO_PORT_LPC13Uxx.svd.xml
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>SET%s</name>
               <description>Write: Set register for port %s/1  Read: output bits for port 0/1</description>
               <addressOffset>0x2200</addressOffset>
               <fields>
                  <field>
                     <name>SETP0</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP1</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP2</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP3</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP4</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP5</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP6</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP7</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP8</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP9</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP10</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP11</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP12</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP13</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP14</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP15</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP16</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP17</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP18</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP19</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP20</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP21</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP22</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP23</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP24</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP25</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP26</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP27</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP28</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP29</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP30</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETP31</name>
                     <description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>CLR%s</name>
               <description>Clear port %s/1</description>
               <addressOffset>0x2280</addressOffset>
               <access>write-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CLRP00</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP01</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP02</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP03</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP04</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP05</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP06</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP07</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP08</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP09</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP010</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP011</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP012</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP013</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP014</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP015</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP016</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP017</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP018</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP019</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP020</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP021</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP022</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP023</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP024</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP025</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP026</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP027</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP028</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP029</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP030</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRP031</name>
                     <description>Clear output bits: 0 = No operation. 1 = Clear output bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
