podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/GPIO_PORT_LPC13Uxx.svd.xml
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>NOT%s</name>
               <description>Toggle port %s/1</description>
               <addressOffset>0x2300</addressOffset>
               <access>write-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>NOTP0</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP1</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP2</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP3</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP4</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP5</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP6</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP7</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP8</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP9</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP10</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP11</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP12</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP13</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP14</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP15</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP16</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP17</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP18</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP19</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP20</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP21</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP22</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP23</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP24</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP25</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP26</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP27</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP28</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP29</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP30</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTP31</name>
                     <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
